Tekla Open API Reference for Tekla Structures 2025
Offset.Dz Property
 The current object's Dz offset. This value is defined using the current work plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Dz { get; set; }
Public Property Dz As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Offset Class
Tekla.Structures.Model Namespace